{"pageProps":{"frontmatter":{"title":"Customer Segmentation using Data Science","description":"A Data Scientists Guide to Segmenting your Customers using clustering algorithms and decision trees.","date":"February 6, 2021"},"post":{"content":"\n*TL;DR: A Data Science Tutorial and using K-Means and Decision Trees together.*\n\nCustomer segmentation (sometimes called [Market Segmentation](https://en.wikipedia.org/wiki/Market_segmentation)) is ubiqutous in the private sector. We think about bucketing people into $k$ mutually exclusive and collectively exhausting (MECE) groups. The premise being that instead of having 1 strategy for delivering a product or experience, providing $k$ experiences or strategies will yield much better engagement or acquisition from our customers.\n\nGenerally speaking, this makes sense; it's intuitive. Provide people a more curated experience and they will enjoy it more...and the more personalized the better. \n\nNetflix, Spotify, YouTube, Twiter, Instagram, and all of the big tech companies have mastered personalization by using robust, computationally expensive, and sophisticated machine learning pipelines. But the world has been doing this for a long time, just a much less sophisticated version.\n\nSo I thought I'd give a technical demo of what customer segmentation looks like in a basic way using a trick I've used for years.\n\nHere are the things I'd like to cover during this demo:\n\n1. What options do I have to segment my customers?\n2. How do I actually do the segmentation?\n3. What can I do with my new customer segments?\n4. How do I know that my segments are effective?\n5. How do I know when my segments have changed?\n\n## Approaches to Customer Segmentation\n\nThe phrase \"Customer Segments\" tends to mean different things across different industries, organizations, and even across business functions (e.g., marketing, risk, product, etc.). \n\nAs an example, for a consumer products retailer, they may refer to customer segments using both demographic information or their purchase behavior, where a lender may refer to their segments based on credit score bands. While very meaningfully different from a business perspective, the same algorithms can be used for both problems.\n\nAnalytically speaking, I've seen Customer Segments defined really in two main ways: (1) Business Segments and (2) Algorithmic Segments. Usually executives refer to their segments in the first category and data scientists focus on the second. The first is really important organizationally because 99% of the people working with your customers don't care about how you bucketed them and customers are the most important thing. Always.\n\n...but how do you *actually* (i.e., in code and data) get to those segments?\n\n### 1. Logical Business Segments\nThese segments tend to be defined by heuristics and things that make common sense. They are often built on things that are aligned with the goal of the business.\n\nHere are some examples:\n\n- The age of the customer (in years)\n- The income of the customer (in dollars or thousands of dollars)\n- The amount of money a customer spent in the last year\n- The likelihood a customer will spend money at a given store (purchase propensity / propensity to buy)\n- The customer's geographic region (e.g., zipcode, state)\n- In data, some of that customer information would look something like this:\n\n<table>\n  <tr>\n    <th>User ID</th>\n    <th>Age</th>\n    <th>Customer Income</th>\n    <th>Purchase Propensity</th>\n    <th>...</th>\n  </tr>\n  <tr>\n    <td>1</td>\n    <td>25</td>\n    <td>$45,000</td>\n    <td>0.9</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>2</td>\n    <td>30</td>\n    <td>$80,000</td>\n    <td>0.4</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>n</td>\n    <td>56</td>\n    <td>$57,000</td>\n    <td>0.1</td>\n    <td>...</td>\n  </tr>\n</table>\nAnd so on.\n\nWe would apply some logic/code to create segment like:\n\n- Age Buckets\n    1. < 25\n    2. 25-35\n    3. 35-55\n    4. 55+\n- Income Buckets\n    1. < $25K\n    2. $25K-50K\n    3. $50K-100K\n    4. $100-150K\n    5. $150K+\n- Propensity Buckets\n    1. Low: [0, 0.25]\n    2. Medium: [0.25, 0.75]\n    3. High: [0.75, 1.0]\n\nAnd map that logic into our data:\n<table>\n  <tr>\n    <th>User ID</th>\n    <th>Age Bucket</th>\n    <th>Income Bucket</th>\n    <th>Propensity Bucket</th>\n    <th>...</th>\n  </tr>\n  <tr>\n    <td>1</td>\n    <td>25-35</td>\n    <td>$25K-50K</td>\n    <td>High</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>2</td>\n    <td>25-35</td>\n    <td>$50K-100K</td>\n    <td>Medium</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>n</td>\n    <td>56</td>\n    <td>$50K-100K</td>\n    <td>Low</td>\n    <td>...</td>\n  </tr>\n</table>\nAnd so on.\n\nPretty simple, right? The code for this is simple too (assuming you're using Pandas and Python; though it's also simple in SQL).\n\n# Here's one example\n```python\ncdf['Income Bucket'] = pd.cut(cdf['Annual Income ($K)'], \n    bins=[0, 25, 35, 55, np.inf], \n    labels=['<25', '25-35', '35-55', '55+']\n)\n```\nThis is a really helpful and simple way to understand our customers and it's the way that most businesses do analytics, but we can do more. 😊\n\n### 2. Algorithmic Segments\n\nSegments defined using simple business logic are great because they are so simple and easy to interpret, but that's not free.\nBy favoring simplicity we have to limit ourselves to (potentially) suboptimal segments. \nThis is typically on purpose and entirely fine but, again, we can do better.\n\nSo how do we do better?\n\nCue statistics, data mining, analytics, machine learning, or whatever it's called this week. More specifically, we can use the classic [K-Means Clustering](https://en.wikipedia.org/wiki/K-means_clustering) algorithm to *learn* an optimal set of segments given some set of data.\n\nTo skip over many important details ((more reading here)[https://towardsdatascience.com/customer-segmentation-using-k-means-clustering-d33964f238c3]), K-Means is an algorithm that optimally buckets your data into $K$ groups (according to a specific mathematical function called the [euclidean distance](https://en.wikipedia.org/wiki/Euclidean_distance)). It's a classic approach and tends to work quiet well in practice (there are a ton of other neat [clustering algorithms](https://en.wikipedia.org/wiki/Cluster_analysis#Algorithms)) but one non-technical challenge is (1) choosing $K$ and (2) explaining what a single cluster actually means to a non-technical stakeholder.\n\n\n\n\n","excerpt":""},"previousPost":{"slug":"how-to-build-a-credit-risk-model","frontmatter":{"title":"How to Build a Credit Risk Model","description":"A Data Scientists Guide to Building a Basic Credit Risk Model","date":"January 31, 2021"},"excerpt":"","content":"\n*TL;DR: A Data Science Tutorial on building a Credit Risk model.*\n\nI previously [wrote](/post/data-science-and-fintech) about some of the work data scientists do in the fintech space, which briefly discussed [credit risk models](https://en.wikipedia.org/wiki/Credit_risk) but I wanted to write a more technical review and talk about what I think are the most important points.\n\nI spent most of my career at banks as a data scientist and built credit risk, fraud, and marketing models in the consumer and commercial space in the US, Australia, and South Africa. I learned a lot from those experiences, so I thought I'd share a simple example of how one of the core pieces of algorithmic/quantitative underwriting is done.\n\nIn this post, I'll try to answer the following questions:\n\n- What is a credit risk model?\n- What data does a credit risk model use?\n- How do you estimate a credit risk model?\n- How do you know if your model is performing well?\n- What are some common mistakes to avoid?\n- What are useful facts to know about credit risk models?\n\nIt's worth caveating up front that this is a very narrow take focused only on the analytical aspect of the work and there is an extraordinary amount of legal, compliance, and business work that I am intentionally omitting.\n\nWith that said, let's dive right in.\n\n## What is a Credit Risk Model?\n\nIn the consumer/retail space, a credit risk model tries to predict the probability that a consumer won't repay money that they've borrowed.\nA simple example of this is an [unsecured personal loan](https://www.investopedia.com/terms/u/unsecuredloan.asp). \n\nLet's suppose you submitted an application to borrow $5,000 from a lender. That lender would want to know the likelihood of [default](https://www.investopedia.com/terms/d/default2.asp) before deciding on (1) whether to give you the loan and (2) the price they want to charge you for borrowing the money. So that probability is probably quite important...but how do they come up with it?\n\n## What Data does a Credit Risk Model Use?\n\nLenders typically use data from the major [Credit Bureaus](https://www.investopedia.com/personal-finance/top-three-credit-bureaus/) that is [FCRA](https://www.ftc.gov/enforcement/statutes/fair-credit-reporting-act) compliant, which basically means that the legal and reputational risk of using this data is very low.\n\nTypically, you'd purchase a dataset from one of the bureaus (or use data inside one of their analytical sandboxes) and clean the dataset into something that looks like the following:\n\n<table>\n  <tr>\n    <th>Default</th>\n    <th>Inquiries in Last 6 Months</th>\n    <th>Credit Utilization</th>\n    <th>Average Age of Credit</th>\n    <th>...</th>\n  </tr>\n  <tr>\n    <td>Yes</td>\n    <td>2</td>\n    <td>0.8</td>\n    <td>12</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>No</td>\n    <td>8</td>\n    <td>0.0</td>\n    <td>2</td>\n    <td>...</td>\n  </tr>\n  <tr>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n    <td>...</td>\n  </tr>\n</table>\n\nAnd so on.\n\nIn summary, it's just a bunch of data about your borrowing history.\nIt's a little recursive/cyclical because in order to grow your credit you need to have credit but let's ignore that detail.\n\nOne of the most important steps in the model development process is *precisely* defining **default** because this will eventually reflect the performance of your portfolio defining it thoughtfully, accurately, and confidently is extremely consequential.\n\nSo how do you define it?\n\nTime. \n\nIf you're planning to launch a term loan, you usually set boundaries on the duration of the loan. For revolving lines of credit (like a credit card), you simply apply a reasonable boundary on time that makes good business sense.\n\nLet's say you want to launch a 12 month loan to an underserved market, then you'd want to get historical data of other lenders to build your model on.\nIt sounds a little surprising that you can do this but that's basically how the bureaus make their money.\n\nAn important thing to keep in mind is that you need to make sure you pull the data at 2 different time periods: (1) when the original application was made so you can use data that is relevant for underwriting (and so you don't have forward-looking data resulting in [data leakage](https://www.kaggle.com/dansbecker/data-leakage)) and (2) 12 months later (or whatever time period is appropriate for you) to check if the consumer defaulted on their loan.\n\nThere's a lot more to it and you can expand on things in much more elegant ways to handle different phenomena but for the sake of simplicity, this is essentially how it's done.\n\nSo, after painfully cleaning up all that data, what do you do with it?\n\n## Building a Probability of Default Model\n\nNow that you have that glorious dataset you can start to run different [Logistic Regressions](https://en.wikipedia.org/wiki/Logistic_regression) or use other classification based [machine learning](https://www.kdnuggets.com/2016/08/10-algorithms-machine-learning-engineers.html) algorithms to find hidden patterns and relationships (i.e., [non-linear functions](https://blog.minitab.com/blog/adventures-in-statistics-2/what-is-the-difference-between-linear-and-nonlinear-equations-in-regression-analysis#:~:text=If%20the%20equation%20doesn't,a%20linear%20equation%2C%20it's%20nonlinear.&text=Thetas%20represent%20the%20parameters%20and,one%20parameter%20per%20predictor%20variable.) and [interaction terms](https://en.wikipedia.org/wiki/Interaction_(statistics))).\n\nPersonally, this is the most intellectually engaging part of the work. The other work involved in credit risk modeling is usually very stressful and filled with less exciting graphs but here you get to pause, look at data, and, for a moment, try to make a crude approximation of the world. I find this part *fascinating*.\n\nIf we stick with our simple dataset above for our model, we could use our good old friend Python to run that Logistic Regression.\n\n```python\nimport numpy as np\nimport statsmodels.api as sm\n\n# Generating the data \nn = 10000\nnp.random.seed(0)\nx_1 = np.random.poisson(lam=5, size=n)\nx_2 = np.random.poisson(lam=2, size=n)\nx_3 = np.random.poisson(lam=12, size=n)\ne = np.random.normal(size=n, loc=0, scale=1.)\n\n# Setting the coefficient values to give us a ~5% default rate\nb_1, b_2, b_3 = -0.005, -0.03, -0.15\nylogpred =  x_1 * b_1 + x_2 * b_2 + x_3 * b_3 + e\nyprob = 1./ (1.+ np.exp(-ylogpred))\nyclass = np.where(yprob >= 0.5, 1, 0)\nxs = np.hstack([\n    x_1.reshape(n, 1), \n    x_2.reshape(n, 1), \n    x_3.reshape(n, 1)\n])\n# Adding an intercept to the matrix\nxs = sm.add_constant(xs)\nmodel = sm.Logit(yclass, xs)\n# All that work just to run .fit(), how terribly uninteresting\nres = model.fit()\nprint(res.summary())\n\n         Current function value: 0.163863\n         Iterations 8\n                           Logit Regression Results                           \n==============================================================================\nDep. Variable:                      y   No. Observations:                10000\nModel:                          Logit   Df Residuals:                     9996\nMethod:                           MLE   Df Model:                            3\nDate:                Fri, 29 Jan 2021   Pseudo R-squ.:                  0.1056\nTime:                        00:08:17   Log-Likelihood:                -1638.6\nconverged:                       True   LL-Null:                       -1832.2\nCovariance Type:            nonrobust   LLR p-value:                 1.419e-83\n==============================================================================\n                 coef    std err          z      P>|z|      [0.025      0.975]\n------------------------------------------------------------------------------\nconst          0.4535      0.209      2.166      0.030       0.043       0.864\nx1            -0.0439      0.023     -1.949      0.051      -0.088       0.000\nx2            -0.0390      0.035     -1.109      0.267      -0.108       0.030\nx3            -0.3065      0.017    -18.045      0.000      -0.340      -0.273\n==============================================================================\n```\n\nWow, look at all of that beautiful, useless statistical output! \n\nIt's not *really* useless but 99% of the people involved will not find it useful. \nSo we probably need an alternative way to show and inform these results to non-technical stakeholders (but you as a data scientist can look at this as much as you'd like).\n\n![The Glorious Lift Chart!](liftchart.png)\n<p align=\"center\" style=\"padding:0\"><i>The Beloved Lift Chart</i></p>\n\nCue the [Lift Chart](https://www.casact.org/education/rpm/2016/presentations/PM-LM-4.pdf). This chart may look fancy but it's actually pretty simple, it's just [deciling](https://www.investopedia.com/terms/d/decile.asp) your data (i.e., sorting and bucketing into 10 equal groups) according to the *predicted* default rate from your model. It's worth noting that this is a quantized and reversed version of the [ROC chart](https://en.wikipedia.org/wiki/Receiver_operating_characteristic) and they represent the same information.\n\nThere are 3 important pieces of information from this graph: \n\n1. The AUC tells you the performance\n2. The closer the two lines are together the more accurate the probability estimate\n3. The steeper the slope at the higher deciles, the better the rank order separation\n\nIf you had perfect information, you'd get a graph that looks like this:\n\n![The Perfect Lift Chart!](liftchart_optimal.png)\n<p align=\"center\" style=\"padding:0\"><i>If your model looks like this, you've done something terribly wrong</i></p>\n\nAnd here's the code to generate those graphs.\n\n```python\nimport numpy as np\nimport pandas as pd\nfrom matplotlib import pyplot as plt\nfrom sklearn.metrics import roc_auc_score\n\ndef liftchart(df: pd.DataFrame, actual: str, predicted: str, buckets: int=10) -> None:\n    # Bucketing the predictions (Deciling is the default)\n    df['predbucket'] = pd.qcut(x=df[predicted], q=buckets)\n    sdf = df[[actual, predicted, 'predbucket']].groupby(\n        by=['predbucket']).agg({\n        actual: [np.mean, sum, len], \n        predicted: np.mean\n        }\n    )\n    aucperf = roc_auc_score(df[actual], df[predicted])\n    sdf.columns = sdf.columns.map(''.join) # I hate pandas multi-indexing\n    sdf = sdf.rename({\n        actual + 'mean': 'Actual Default Rate', \n        predicted + 'mean': 'Predicted Default Rate'\n    }, axis=1)\n    sdf[['Actual Default Rate', 'Predicted Default Rate']].plot(\n        kind='line', style='.-', grid=True, figsize=(12, 8), \n        color=['red', 'blue']\n    )\n    plt.ylabel('Default Rate')\n    plt.xlabel('Decile Value of Predicted Default')\n    plt.title('Actual vs Predicted Default Rate sorted by Predicted Decile \\nAUC = %.3f' % aucperf)\n    plt.xticks(\n        np.arange(sdf.shape[0]), \n        sdf['Predicted Default Rate'].round(3)\n    )\n    plt.show()\n\n# Using the data and model from before!\npdf = pd.DataFrame(xs, columns=['intercept', 'x1', 'x2', 'x3'])\npdf['preds'] = res.predict(xs)\npdf['actual'] = yclass\n\n# Finally, what we all came here to see\nliftchart(pdf, 'actual', 'preds')\n\n# This is what it looks like when we have perfect information\npdf['truth'] = pdf['actual'] + np.random.uniform(low=0, high=0.001, size=pdf.shape[0])\nliftchart(pdf, 'actual', 'truth', 10)\n```\n<center><i>Judge me not by the elegance of my code but by the fact that it runs.</i></center>\n\n## Evaluating your Default Model\n\nSo this visualization is helpful, but how do you quantify the performance into a single number? Well, how about [Accuracy](https://en.wikipedia.org/wiki/Accuracy_and_precision)?\n\nIt turns out that Accuracy isn't really a great metric when you have a low default rate (or more generally when you have severe [class imbalance](https://en.wikipedia.org/wiki/Accuracy_paradox)). As an example suppose you have a 5% default rate, that means 95% of your data did *not default*, so if your model predicted that no one defaulted, you'd have 95% accuracy.\n\nAccurate, obvious, and entirely useless. Without proper adjustment, this behavior is actually very likely to occur in your model, so we tend to ignore the accuracy metric and instead we focus on the rank order seperation/predictive power of the model.\n\nTo measure that predictive power, there are 4 metrics industry professionals typically look at to summarize their model: [Precision, Recall](https://en.wikipedia.org/wiki/Precision_and_recall), the [Kolomogorov-Smirnov (KS) Test](https://en.wikipedia.org/wiki/Kolmogorov–Smirnov_test), and [Gini/AUC](https://en.wikipedia.org/wiki/Receiver_operating_characteristic#Area_under_the_curve).\n\nOne point of humor that has been a surprisingly common topic of discussion in my career is the equivalence of Gini and AUC. Bankers like Gini, for whatever inertia related reason, but it's equivalent to AUC via:\n\n$$Gini = 2 * AUC - 1$$ \n\nand obviously\n\n$$AUC = \\frac{Gini+1}{2}$$.\n\nGini is bound between [-1, 1] and AUC between [0, 1] but technically if your AUC is less than 0.5 (and < 0 for Gini) that means you're doing worse than random ([and you could do better by literally doing the opposite of what your model says](https://stats.stackexchange.com/questions/266387/can-auc-roc-be-between-0-0-5)) so most people will say AUC is between [0.5, 1] and that Gini is between [0, 1].\n\nA good model is usually around 70% AUC / 40% Gini. The higher the better.\n\nIt's always useful to look at your lift chart as it can tell you a lot about how predictive the model is at different deciles. In some cases, your model may not have enough variation in the attributes/features/predictors to differentiate your data meaningfully. The metric won't show you that, only a glance at the lift chart will, so it's always a good to review it.\n\nOne important point here is that any single metric is very crude and a data set can be pathologically constructed to break it, so while these metrics and charts are very helpful, there are cases where things can still misbehave even though they seem normal.\n\nNow that you have your exciting new default model, you can use it in your underwriting strategy to differentiate amongst your competitors on pricing, approve/decline, and targeting customers, right?\n\nNot quite.\n\n## Common Mistakes and Pitfalls\n\nBefore you get too excited about your model, you want to verify that it's behaving logically, so I thought I'd list some items that you will want to check against to make sure nothing disastrous will happen. \n\n- Double check for [Data Leakage](https://www.kaggle.com/dansbecker/data-leakage)\n- Verify that you don't have any [data errors](https://www.datasciencecentral.com/profiles/blogs/common-errors-in-machine-learning-due-to-poor-statistics-knowledg)\n- Make sure you've done your best not to fall for [Simpson's Paradox](https://en.wikipedia.org/wiki/Simpson%27s_paradox)\n- Validate your model with an [Out of Time](https://statmodeling.stat.columbia.edu/2016/11/22/30560/) Hold Out Sample\n- Confirm your model actually has a [representative sample](https://www.investopedia.com/terms/r/representative-sample.asp#:~:text=A%20representative%20sample%20is%20a,three%20males%20and%20three%20females.) of your future portfolio\n- Make sure you're not time traveling \n    - This is a form of Data Leakage (Leaky Predictors) and it's basically making sure you don't use data that's in the future of what you're representing (except the default flags that you're trying to predict/model)\n- Understand the correlation your *predicted default* may have to your other products in your portfolio\n    - This is not important from a statistical perspective but it is very important for your business\n- Always be skeptical if your model performs too well\n    - This is very likely data leakage and can be very embarrassing if you over-excite management\n\nI could have written a book ([recommendation here](https://www.amazon.com/Credit-Risk-Modelling-Theoretical-Foundations-Diagnostic-ebook/dp/B07FZGG63V)) with a much longer set of information both from a statistical and business lense but, for the sake of brevity, I wrote the most pressing ones and I invite you to search for more information about other important details.\n\n## Some other Interesting Extensions\n\n\n### Model Extensions\nThe model I showed above is quite literally the most basic example and the models that most lenders and vendors use are much, much more sophisticated. Many of them have enhanced their models to handle [panel data](https://en.wikipedia.org/wiki/Panel_data) (i.e., cohorts of people over time) and can construct models that are extremely robust.\n\nThe best class of models in this elite category (in my personal opinion) are [Discrete Time Survival Models](https://bookdown.org/content/4253/fitting-basic-discrete-time-hazard-models.html). Actually, this isn't *my* opinon, this wisdom was shared with me from two of the former heads of statistical modeling at Capital One, so don't trust my judgement, trust theirs.\n\n### Quantization and the Weight of Evidence\nAnother interesting implementation detail is that statisticians/data scientists in the credit scoring space often transform the inputs/attributes/features of their model via [quantization](https://en.wikipedia.org/wiki/Quantization). More specifically through a transformation called the [Weight of Evidence](https://multithreaded.stitchfix.com/blog/2015/08/13/weight-of-evidence/). It's neat, troglodytic, and surprisingly effective.\n\n\n### Adverse Action Reasons\nCredit risk modeling requires the underwriter to grant adverse action codes in the case of rejecting a customer who applies for a credit product (this is a driven by the FCRA). Doing this algorithmitically is very doable and different organizations do it slightly differently but the short version is you take the absolute largest partial predictions (i.e., $argmax_{x}f(x_j) = |x_j * \\beta_j|$,  $\\forall j=1,..., k$).\n\n### Model Complexity and Usefulness\nLastly, when building these statistical models the most important thing to think about is the trade-off between complexity and performance on your target population. Typically in the lending space you will not approve all of your customers, so obsessing over model fit on the proportion of your population that won't be approved is not always useful. It's a small point, but extremely consequential and will hopefully save you some time.\n\n## Conclusion\n\nThis tutorial was not nearly as code heavy as I would have liked (only showing a very silly regression) but I felt like the content was still rather dense ([the full code is available here](https://github.com/franciscojavierarceo/Python/blob/master/credit-model-demo.py)).\n\nPeople spend their careers studying these statistical models and the important consequences of them, so I really want to emphasize how much I have trivialized the work here only for the sake of simplicity. I have not talked about how you can improve the model when it's underperforming or how one can try to measure biases that may occur, but these are important pieces for society.\n\nI will conclude by saying that these models are heavily governed by many layers of regulation. As a statistician and a minority, I think this is a good thing.\nThat's not to say that harm isn't caused by these models because I think there is but I do think machines are more easily governed, evaluated, and modified...unlike human decision making which can be subjective and prone to unknown biases that are difficult to quantify ([here's some additional reading material](https://faculty.haas.berkeley.edu/morse/research/papers/discrim.pdf)).\n\nI hope you found this post useful and interesting.\n\n*Have some feedback? Feel free to [let me know](https://twitter.com/franciscojarceo)!*"},"nextPost":null},"__N_SSG":true}