{"pageProps":{"postData":{"id":"github-actions","contentHtml":"<p>I'm a huge fan of <a href=\"https://github.com/features/actions\">GitHub Actions</a>. They're so simple but so effective at doing such a broad range of things. In short, you can tell GitHub do something on a computer everytime you push to your repository (or to a branch on a specific repository like the <code>main</code> branch).</p>\n<p>For today's post, I'll focus on how I used an action to automate deploying my static site built with Next.js to <a href=\"https://pages.github.com\">GitHub Pages</a>.</p>\n<p>I made this blog on a repository hosted on GitHub and added an action to compile the JavaScript/React into static HTML files. This really didn't require all that much effort.</p>\n<p>Here's what I had to do:</p>\n<ol>\n<li>Built a Next.js blog following the <a href=\"https://nextjs.org/learn/basics/create-nextjs-app\">detailed tutorial</a> and store the code on a GitHub repository</li>\n<li>Create a workflow file in the repository with the following path: <a href=\"https://github.com/franciscojavierarceo/franciscojavierarceo.github.io/blob/main/.github/workflows/integrate.yml\"><code>./github/workflows/integrate.yml</code></a></li>\n<li>Specify that workflow file to export the static files whenever I push to <code>main</code> and <em>commit</em> the exported files to a separate branch called <code>gh-pages</code> (you can just follow the workflow file I used)</li>\n<li>Manually add a <code>.nojekyll</code> file to the <code>gh-pages</code> branch (this is to resolve <a href=\"https://github.com/vercel/next.js/issues/2029\">this bug</a>)</li>\n<li>Configure my repository branch settings so that sources the GitHub Pages build from the <code>gh-pages</code> branch</li>\n</ol>\n<p>And that's it, adding new blog posts is as simple as creating a new <a href=\"https://www.markdownguide.org/\">markdown</a> file and pushing to the main branch. The GitHub Action will handle all of the rest!</p>\n<p>This is much nicer in behavior than my old site, which was built using Jekyll (a Ruby framework) and it's much less work than Django to get high quality page loads.</p>\n","title":"Deploying a Next.js site using Github Actions","date":"2020-01-03","description":"GitHub Actions to Deploy a Static Site built with Next.js"}},"__N_SSG":true}