{"pageProps":{"frontmatter":{"title":"Paradoxes and Cognitive Biases","description":"A brief review of some of my favorite paradoxes and cognitive biases.","date":"May 26, 2022"},"post":{"content":"\n# The Irrationality of Humans\n\nI find human behavior and decision making wildly fascinating...and mostly comical,\nespecially my own. This is because of the variety of paradoxes, cognitive biases,\nand irrationalities that are constantly at play in our micro and macro conclusions.\n\nIn fact, these irrational behaviors are largely what led me into the career I have today.\nIt all started with *economics and statistics* (my first graduate degree/love)\nand I've spent ten years working in understanding human behavior. Maybe the methods\nand engineering are fancier now than back then but, at my core, I am still\nfascinated by human behavior, data, and statistical inference—the methods that\nprovide a glimpse of understanding about a person's choices.\n\nWhat I've found is that humans are just kind of ***weird*** in their\nbehaviors and decision making. Some would say down right irrational...I certainly\nwould.\n\nMuch of that irrationality comes from all sorts of paradoxes and cognitive\nbiases that are well known in different academic disciplines (particularly\nbehavioral economics and statistics) but that aren't as well known by most\nfolks. So I thought I'd write briefly about them and why they're important.\n\nIt's worth emphasizing that even if you are aware of these things, you are still quite\nlikely to be subject to them or make the mistakes they call out—***I do all of the\ntime***. Regardless, knowing them can—to some degree—help you mitigate them\nand help you make better decisions.\n\nI would like to over-emphasize that my own decision making is nothing to brag\nabout but I decided to write this because I thought it'd be fun and I do love\nthis topic.\n\n# Paradoxes and Biases\n\nI have decided to explicitly order these in the order I felt is the most\nimportant. This, too, is ridden with bias but I believe that this is the\norder most important to me and that I've found the most useful in my\npersonal and professional life.\n\n## 00. The Dunning-Kruger Effect\n\n[The Dunning-Kruger Effect](https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect)\nis one of the most important cognitive biases that exist, probably because of how\nimpactful it is to everyone (i.e., we all suffer from the burden of incompetent\npeople and it is quite likely we, too, are someone's burden).\n\nIn short, people with low ability at a given task tend to overestimate their\nability and those with high ability tend to underestimate it.\n\nIf you pay attention, you will see this occurrence often...especially from\nthose without much experience in a given area of expertise (though this is not\nalways true).\n\nYou may see this often from people in business...run away.\n\n## 01. The Double Standard\n\nThis is probably my favorite bias because people (like me, for example) commit\nthis often and it's such a subtle yet common thing. I believe this bias to be a\nconsequence of the Dunning-Kruger Efect mentioned above.\n\nDefinitionally, a Double Standard is \"the application of different sets of\nprinciples for situations that are, in principle, the same.\"\n\nI find this to be very important professionally as people often have unrealistic\nexpectations of others that they wouldn't have of themselves. I find this\ncomes up when folks without domain expertise are frustrated by timelines of\nfor building various things.\n\nSaid another way, *\"Why does this take so long?\"*\n\nAs a manager, I regularly ask myself \"If I were doing this, would I expect the\nsame outcome in the same time?\" and I find that this helps me better empathize\nand be more realistic about the outcomes.\n\nMore importantly, my colleagues probably find me more tolerable. :)\n\n## 02. The Curse of Knowledge\n\nI say this non-ironically: something is obvious when you know it, and not\nif you don't—so too the definition of [the Curse of Knowledge](https://en.wikipedia.org/wiki/Curse_of_knowledge).\n\nThis is something I experienced a lot in my career because people often forget\nall of the context they have when referencing something. Business is very\njargony so when I onboard people or explain things I very explicitly try to\navoid using acronyms or cryptic language. It certainly takes mental effort but\nit makes it much less frustrating for the other party.\n\nAlso, I find that assuming someone knows something or being surprised that\nsomeone *doesn't* know something can sound extremely condescending, so probably\nit may be best to avoid that.\n\n## 03. Simpson's Paradox\n\nI could write an entire post about [Simpson's Paradox](https://en.wikipedia.org/wiki/Simpson%27s_paradox)\nbut, to keep it brief, Simpson's Paradox is a statistical phenomenon in which a\ncorrelation between two variables can be reversed by the addition of another.\n\nBut how??? Time for a graph!\n\n![Simpson's Paradox: Negative Correlation](simpsons_paradox_1.png)\n\nAbove variables $X$ and $Y$ are negatively correlated, quite strongly too with\na correlation coefficient of -0.74. But what if there was some other group\nvariable $Z$ which represented 5 groups, we would then be able to see:\n\n![Simpson's Paradox: Positive Correlation](simpsons_paradox_2.png)\n\nOh no! The exact opposite conclusion! It's worth knowing that in statistics and\nin life, you may never know of the existance of $Z$.\n\nSo while this is useful for regression and statistical inference, I find this\nparadox to be applicable to many more situations.\n\nSimply, I may *always* be missing a single, critical piece of information that\nmay flip my conclusion. So I tend to calibrate my opinions accordingly.\n\n## 04. The Sunk Cost Fallacy\n\nAs elegantly written by [The Decision Lab](https://thedecisionlab.com/biases/the-sunk-cost-fallacy),\n\"The Sunk Cost Fallacy describes our tendency to follow through on an endeavor\nif we have already invested time, effort, or money into it, whether or not the\ncurrent costs outweigh the benefits.\"\n\nEmotion often clutters our ability to understand the *actual* expected\nvalue/reward of a given thing we are putting effort into but sometimes it is\nin our best interest to cut our losses rather than see it through.\n\nIt rarely feels good but can often be the optimal decision.\n\n## 06. Loss Aversion\n\nLoss aversion is simply the disproportional weight a person often places on\nminimizing losses to acquire economic gains.\n\nFor example, someone may prefer to take \\$10 with 100% certainty rather than\n\\$20 with 90% certainty because the displeasure from that 10\\% possibility\noutweighs the pleasure they'd receive from the additional \\$10 (or expected\n\\$8 = (0.9 * 20) - 10).\n\nThis is extremely irrational and puts non-disciplined investors at a mathematical\ndisadvantage.\n\n## 07. The Gambler's Fallacy\n\nThe [Gambler's Fallacy](https://en.wikipedia.org/wiki/Gambler%27s_fallacy)\nrefers to the incorrect belief that a given event is more\nor less likely given a previous sequence of events when the event is not a\nfunction of time.\n\nThis can be seen through coin flips. If you see 5 heads flipped in a row, you\nmay think that a tails is \"due\" but this is incorrect (assuming a fair coin) since\ncoin flips are always independent (i.e., one flip doesn't depend on the next).\n\n## 08. Anchoring\n\nPulling again from [the Decision Lab](https://thedecisionlab.com/biases/anchoring-bias),\n\"Anchoring is a cognitive bias that causes us to rely too heavily on the first\npiece of information we are given about a topic. When we are setting plans or\nmaking estimates about something, we interpret newer information from the\nreference point of our anchor, instead of seeing it objectively.\"\n\nThis is often used in marketing and pricing to delude you into thinking\nsomething is on sale. :')\n\n## 09. Sample Bias\n\nSample bias originates from statistics and is a result of a flawed collection\nof an intended random sample.\n\nThis is particularly common in business and Twitter where people think their\ncustomers or Twitter poll-responders are representative of the entire\npopulation.\n\nThey're not and this can often lead to very poor decision making or conclusions.\n\n## 10. Assignment Bias\n\n[Assignment Bias](https://www.statisticshowto.com/assignment-bias/#:~:text=Assignment%20bias%20happens%20when%20experimental,people%20who%20are%20significantly%20smarter.)\nis similar to Sample Bias in that it is a bias in the sample\nbut is rooted in a broken assignment system. For example, imagine an\nexperimental drug trial where the \"random assignment machine\" (i.e., a machine\nthat assigns things at random) only treated the young and healthy,\nwhile that is a pathological and extreme example it highlights the issue.\n\nBy the way, it turns out that a good \"random\" sample is extremely hard to\ncollect in the real world—ask the Census.\n\n## 11. Self-Selection Bias\n\n[Self-Selection Bias](https://en.wikipedia.org/wiki/Self-selection_bias)\nis another form of sample bias but it's caused by the participants choosing\nwhether or not to participate in the experiment or treatment.\n\nAgain, in the example above imagine instead that the \"random assignment\nmachine\" only treated the people who wanted to be treated and not the\nones that did.\n\nSimilar to the previous case it would ruin the experiment.\n\n## 12. Decision Fatigue\n\n[Decision Fatigue](https://en.wikipedia.org/wiki/Decision_fatigue) is a\nphenomenon whereby an individual's decision making quality deteriorates after a\nlong session of decision making.\n\nIn short, you get tired of making choices and you start to get sloppy. In the\nbusiness and investing world, this is extremely consequential because your or\nyour investor's money is on the line.\n\n## 13. Optimism Bias\n\nTo quote Wikipedia, \"[Optimism Bias](https://en.wikipedia.org/wiki/Optimism_bias)\nis a cognitive bias that causes someone to believe that they themselves are less\nlikely to experience a negative event. It is also known as unrealistic optimism\nor comparative optimism.\"\n\nIt is good to be optimistic but it is *good-er* to balance it in reality.\n\n## 14. Response Bias\n\n[Response Bias](https://en.wikipedia.org/wiki/Response_bias) is both interesting\nand counterintuitive.\n\nIt is catch-all for the frequent tendency of participants to respond\ninaccurately or falsely to survey questions. This is part of the reason surveys\noften conflict with reality.\n\nAs a statistician, I feel surverys are *kind of* useful but behaviors reveal the\ntruth. Measure behaviors.\n\nFor internet companies, you may find that user-survery metrics conflict with\ntracking metrics that you have for your customer. What people say and what they\ndo are often wildly different.\n\n## 15. The Accuracy Paradox\n\nLastly, [The Accuracy Paradox](https://en.wikipedia.org/wiki/Accuracy_paradox)\nis the paradoxical finding that Accuracy isn't necessarily a good metric for for\nmeasuring statistical or machine learning models.\n\nThis is because of an imbalance of outcomes.\n\nSuppose I was trying to predict a whether someone had a rare illness (1\nout of 10,000 people have it), if I predicted everyone didn't have it I'd still\nhave 99.99% accuracy.\n\nSo, accuracy can often be quite useless as a metric for assessing the\nquality of things in general (though not always).\n\n# Managing the Irrational\n\nYou *probably* can't completely stop yourself from irrational decision making\nbut you can *possibly* manage it.\n\nMy approach is simple: acknowledge the biases above, the idiosyncratic ones I have\nfrom my life exeriences, and reflect frequently. I find that this results in me\nchanging my mind often.\n\nThis can be frustrating but I think that early reactions or understandings\nare often not the optimal ones so I try to put effort into reflecting so that I\ncan just do better.\n\n# Some Advice\n\n(this advice may or may not be useful)\n\nBeing objective is nearly impossible when it relates to human judgement, and I'm\nnot even exactly sure what \"objective\" *really* means outside of mathematics.\n\nBut my advice on being as objective as possible is to write things down:\nbullet points, a simple pros and cons list, or whatever suits you can highlight\nflaws in your judgement and reasoning.\n\nI find this brings me mental clarity more than anything else really. I also\ntend to write things down on paper the good ol' fashion way (maybe it's an\nold habit grounded in problem sets, who knows).\n\nManaging cognitive biases and mitigating the adverse consequences they may hold\nis extremely challenging but a well worthy endeavor, as good decisions compound\nlike great investments.\n\nBut don't worry too much if you find yourself struggling with it, we are all\nhuman after all.\n\n-Francisco\n\n","excerpt":""},"previousPost":{"slug":"binary-representation-of-positive-integers","frontmatter":{"title":"Binary Representation of Positive Integers","description":"A tutorial on converting numbers from decimal to binary...and back!","date":"April 2, 2022"},"excerpt":"","content":"\nIt's always fun to learn some additional tricks in math and computer science and I recently started reading about digital representation of numbers and [Swarthmore](https://www.swarthmore.edu/NatSci/echeeve1/Ref/BinaryMath/NumSys.html#:~:text=In%20summary%3A-,bit,numbers%20from%200%20to%20255.) has some truly great material on this.\n\nI was searching around the internet on how to programatically convert decimal numbers to binary and I found there wasn't *that* great of a resource and stackoverflow had mixed stuff so I thought I'd put it something together quickly.\n\nI'll probably add to this tutorial later but I think the code is the most important part.\n\n# The basics\n\nIn short, we want to represent a decimal number (i.e., a number represented in base 10 via the 10 digits we use [0-9]), e.g., 86, as a binary number (i.e., a number represented in base 2 via the 2 digits we are then limited to [0 and 1]).\n\nAs outlined in the tutorial above, this results in the two representations:\n\n$$86_{10} = 1*64 + 0*32 + 1*16 + 0*8 + 1*4 + 1*2 + 0*1$$\n\nand\n\n$$86_{10} = 1*2^6 + 0*2^5 + 0*2^3 + 1*2^2 + 1*2^1 + 0*2^0$$\n\nWhich is equivalent to saying\n\n$$86_{10} = 1010110_2.$$\n\nThe subscript $2$ denotes a binary number. Each digit in a binary number is called a bit. The number 1010110 is represented by 7 bits. Any number can be broken down this way, by finding all of the powers of 2 that add up to the number in question (in this case 26, 24, 22 and 21).\n\nCool.\n\nSo how do we do this with a computer?\n\n# Binary Representation in Python\n\nAs we saw before, representing 86 in binary format requires us to deconstruct it from $2^n$, so with computers we can represent 86 by either recursively dividing by 2 (with some additional adjustment) or iteratively (via a while loop) doing pretty much the same thing. Here's the recursive version:\n\n```python\ndef decimalToBinary(n: int) -> str:\n    if n == 0:\n        return \"\"\n    else:\n        return decimalToBinary(n // 2) + str(n % 2)\n```\n\nThis is pretty simple and could be trivally mapped to a one-liner but for readability I'll say this is sufficient. Alternatively, we could solve this with a while loop using the following:\n\n```python\ndef decimalToBinary2(n: int) -> str:\n    bs = ''\n    while n > 0:\n        r = n / 2\n        n = n // 2\n        bs = str('1' if r % 1 > 0 else '0') + bs\n\n    return bs\n```\n\nAnd this is also pretty simple. It's worth noting that the str() function call is required before concatenating the binary string variable (i.e., bs) because without it python will actually fail to execute the if-else logic and you will not get the behavior you are looking for.\n\n# Decimal Representation from Binary in Python\n\nOkay, so how do we confirm this is behaving correctly? Obviously we can just recover it.\n\n\n```python\ndef binaryToDecimal(bs: str) -> int:\n    n, r = len(bs), 0\n    for i in range(n):\n        r+= int(bs[i]) * 2**(n - i - 1)\n    return r\n```\n\nAnd that's it! If you stare at this formula for a second you'll see it's just taking each bit in the string and multiplying the $i^{th}$ binary value by $2^{n-i-1}$.\n\nWe can verify that all of this works with some simple checks and comparisons:\n\n```python\ndecimalToBinary(86) == decimalToBinary2(86) # 1010110 == 1010110 --> true\nbinaryToDecimal(decimalToBinary2(86)) == 86 # true, converted 1010110 -> 86\n```\n\nHow cool is that?  I'll note that this is only accurate for positive integers but for the general case you can use the first digit to represent the sign of the numbers (with some handling for the 0 edge case).\n\nHope you found this interesting. As I said I'll elaborate more on this post eventually but I thought I mostly wanted to share the code as I didn't really see good examples providing this back and forth and it was something that helped me understand things more concretely.\n\nHappy typing!\n\n-Francisco\n"},"nextPost":{"slug":"difficulties-deploying-ml-models","frontmatter":{"title":"The Difficulties of Deploying a Machine Learning Model","description":"Sharing some of my goals for 2021","date":"July 5, 2022"},"excerpt":"","content":"\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">you know, deploying machine learning models is very, very difficult</p>&mdash; Francisco Javier Arceo (@franciscojarceo) <a href=\"https://twitter.com/franciscojarceo/status/1544110672660807680?ref_src=twsrc%5Etfw\">July 5, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n# Some Professional History\n\nI've been working in applied machine learning for nearly 10 years and it's quite exciting\nto have experienced firsthand how much machine learning infrastructure has changed.\n\nI spent the first half of my career as a \"modeler\" where I focused on building\nmachine learning and statistical models for a bunch of different use cases. Over\ntime I found that I migrated more and more to the engineering work to get the model\ndeployed because I always found this to be a bottleneck in the work I did.\n\nConcretely, I'd build a pretty good model that suggested it would be impactful\n(based on expectations of the performance) but I often found it was a rather\nextraordinary effort to get it live and interacting with users/customers.\n\nThis is quite well cited by the data science / MLOps space today but it was\nunknown to me back in 2012 and was very frustrating. The good news is that, for\nbetter or worse, I was rather relentless in getting my models over the finish line.\n\nWhich, in many ways, is what led me to the career I have stumbled into today—which\nI am very grateful for—as an engineering manager working at the intersection of\nmachine learning, data, and engineering.\n\nAll this to say that I have spent a surprising share of the last decade working on\ngetting models into live product experiences. I have some lessons learned and\nsome opinions, so I thought I'd share them.\n\n# Ten Lessons Learned form a decade of Deploying ML\n\n## 0. Create a container for you service\n\n## 1. Source Your Data\n\n## 2. Validate Your Feature Engineering\n\n## 3. Codify the range of your features\n\n## 4. Abstract your service logic appropriately\n\n## 5. Precompute what you can\n\n## 6. Load your model at service build time\n\n## 7. Right size your server\n\n## 8. Ensure your prediction is efficient\n\n## 9. Monitor your model and features\n"}},"__N_SSG":true}