{"pageProps":{"frontmatter":{"title":"A Fast Year Indeed","description":"365 days @ Fast","date":"March 4, 2022"},"post":{"content":"\n> I don't know what's going on, and I'm probably not smart enough to understand if somebody was to explain it to me. All I know is we're being tested somehow, by somebody or some thing a whole lot smarter than us, and all I can do is be friendly and keep calm and try and have a nice time till it's over.\n\n-Kurt Vonnegut\n\nAs I reflect on hitting my first official year at Fast, I wanted to write about the two most important lessons I learned.\n\n## 1. Fast is better than perfect\n\nThere are many adages all referencing how striving for perfection interferes with progress and it's really true.\n\nI spent most of my career at large banks (even some of the \"innovative ones\") and the most dramatic difference between these two types of organizations is how much Faster startups are able to move. Others have writen before on how deep this runs in the DNA of startups and seeing it first hand is so exciting. Conversely, at established financial institutions, it's just not the case. The incentives aren't there and the bureacracy and over-processing of process creates too many roadblocks to actually get things done.\n\nOften my gripe at those organizations was that we spent more time on strategy, making presentations, meeting, than actualy doing the work. I'm very supportive of being thoughtful and planning your work, but I think something about big organizations creates an incentive to spend more time talking about the work than actually doing the work.\n\nThat always frustrated me, again, not because I'm against planning or process but rather I'm against process that interferes with progress, which I think is in place at those organizations more than people want to admit.\n\nSo why does that happen? Why do people create processes that interfere with progress?\n\nBecause it *feels* like it matters. But what *feels* good and what actually matters aren't necessarily the same thing and I think big organizations simply lose sight of this fact.\n\nWhich leads me to the other important lesson I learned...\n\n## 2. Focus on what *really* matters\n\nTime is a finite, precious commodity.\n\nIt's a commodity that can't be bought back so I often reflect on what time was wasted \"feeling good\" and what time actually resulted in change. As I get older, this becomes increasingly more important to me and I only recently realized how much time I've wasted trying to feel good rather than trying to do things that mattered, so I'm trying to course correct these days.\n\nAt Fast, I have been so happy with how focused we are on doing work that actually matters. Meetings and work streams are always grounded in action items and next steps, which just makes it all feel like we are working together. And, in truth, that just makes the whole thing fun.\n\nWe are all commonly bound by finite time and I feel lucky to get to choose where I spend it. I am grateful to have spent the last year with Fast builders--brilliant, kind, and talented people who focus on what matters.\n\n-Francisco\n","excerpt":""},"previousPost":{"slug":"2021-reflection","frontmatter":{"title":"2021: A Reflection","description":"My year in review.","date":"December 31, 2021"},"excerpt":"","content":"\nI wrote a little bit about my year in my [last blog post](https://franciscojavierarceo.github.io/post/2021-is-nearly-over) but now that the year is officially ending I wanted to pause for deeper reflection.\n\nSo far this year has gone completely differently than I had originally planned but I am very grateful for it. I started this past year [writing about 2020](https://franciscojavierarceo.github.io/post/learning-new-things) and what I learned, so I thought I would do the same as it closed.\n\nThe end of 2019 and 2020 was a very big year for my family, as my wife and I moved to South Dakota, changed jobs, and bought a home. So quite a lot happend in the latest trip around the sun.\n\n# Learning\n\nI learned a lot this year, as I always try to do. Most of my focus was on software engineering, in part because of my job, and also because of my interests. So here's the list of things I've learned:\n\n- More Django, JavaScript, and React in general \n- More of the ever-evolving AWS ecosystem (it is both the same and very different than it was back in 2014)\n- React Native, mobile development, and deploying to the App Store (this is an exercise on its own)\n- The programming language Go\n- gRPC (Google Remote Procedure Call)\n\nLearning all of these things was mostly painful but also extremely fun. It takes a lot of patience and tinkering to learn to be effective with programming and I really do enjoy it. I find that I'm happiest most often when tinkering to solve new (at least new to me) computer-related puzzles, so it's been a very enjoyable year for me. In fact, we can see the data in the graph below showing all of the times I committed code:\n\n![That's a lot of commits!](2021-commit-count.png)\n<p align=\"center\" style=\"padding:0\"><i>A visualization of my daily computering</i></p>\n\nA fun fact here is that if you compare this to 2020, you'll notice the massive jump in Pull Requests (PRs), which is a fun aside.\n\n# Career\n\nI joined [Fast](https://www.fast.co) last March and it's been an absolutely wild ride, which has been both intellectually fulfilling and exciting, which is a challenging combination to sustain in my experience. \n\nI have to say that of all of the organizations that I have worked for, Fast has been the most fun, which is unexpected since I work from home in South Dakota. By which I mean that I thought that not being in a physical office would have had a bigger influence on my perception of my enjoyment of my job but as it turns out, while I do miss working in an office, the work that I *actually do* is more important to me than being physically next to people that I'm doing the work with (it's not lost on me that this should be obvious but I'm often surprised how irrational or illogical my brain is about things of this nature). More than anything else, I think it's the people that really do make it great. The people that build the software and services, who are the same people that are kind and fun to work with.\n\nI've learned so much working at an extremely fast (pun intended) growing startup over the last 10 months and I really think it's unlikely I'll ever return to banking after working at an organization that values engineering as much as we do.\n\nI've gotten to the place where I feel confident in saying that I am a full stack engineer, which means I need to figure out what new things I'd like to learn next. \n\n# Next Year\n\nIn 2022, I hope to tackle a few big areas professionally:\n\n1. I still have much to learn as a software engineer, so I hope to continue learning from my amazing colleagues\n2. I think we built some really awesome products during my time @ Fast, but there's still so much left so I hope to continue to build and ship impactful products\n3. I want to continue iterating on things I've alreaddy built, specifically on my web and mobile app for [Unidos](https://www.getunidos.com)\n4. I hope to start learning more hardware as it's an area I have somewhat limited knowledge but lots of curiousity\n\nLet's hope I make some progress on those in 2022 and don't abandon (4). Overall I'm very grateful for this past year and I feel lucky to have spent it with the best person a guy could ask for.\n\nWishing you and your loved ones a Happy New Year.\n\n-Francisco\n"},"nextPost":{"slug":"binary-representation-of-positive-integers","frontmatter":{"title":"Binary Representation of Positive Intgers","description":"A tutorial on converting numbers from decimal to binary...and back!","date":"April 2, 2022"},"excerpt":"","content":"\nIt's always fun to learn some additional tricks in math and computer science and I recently started reading about digital representation of numbers and [Swarthmore](https://www.swarthmore.edu/NatSci/echeeve1/Ref/BinaryMath/NumSys.html#:~:text=In%20summary%3A-,bit,numbers%20from%200%20to%20255.) has some truly great material on this. \n\nI was searching around the internet on how to progmatically convert decimal numbers to binary and I found there wasn't *that* great of a resource and stackoverflow had mixed stuff so I thought I'd put it something together quickly.\n\nI'll probably add to this tutorial later but I think the code is the most important part.\n\n# The basics\n\nIn short, we want to represent a decimal number (i.e., a number represented in base 10 via the 10 digits we use [0-9]), e.g., 86, as a binary number (i.e., a number represented in base 2 via the 2 digits we are then limited to [0 and 1]).\n\nAs outlined in the tutorial above, this results in the two representations:\n\n$$86_{10} = 1*64 + 0*32 + 1*16 + 0*8 + 1*4 + 1*2 + 0*1$$\n\nand \n\n$$86_{10} = 1*2^6 + 0*2^5 + 0*2^3 + 1*2^2 + 1*2^1 + 0*2^0$$\n\nWhich is equivalent to saying\n\n$$86_{10} = 1010110_2.$$\n\nThe subscript $2$ denotes a binary number. Each digit in a binary number is called a bit. The number 1010110 is represented by 7 bits. Any number can be broken down this way, by finding all of the powers of 2 that add up to the number in question (in this case 26, 24, 22 and 21).\n\nCool.\n\nSo how do we do this with a computer?\n\n# Binary Representation in Python\n\nAs we saw before, representing 86 in binary format requires us to deconstruct it from $2^n$, so with computers we can represent 86 by either recursively dividing by 2 (with some additional adjustment) or iteratively (via a while loop) doing pretty much the same thing. Here's the recursive version:\n\n```python\ndef decimalToBinary(n: int) -> str:\n    if n == 0:\n        return \"\"\n    else:\n        return decimalToBinary(n // 2) + str(n % 2)\n```\n\nThis is pretty simple and could be trivally mapped to a one-liner but for readability I'll say this is sufficient. Alternatively, we could solve this with a while loop using the following:\n\n```python\ndef decimalToBinary2(n: int) -> str:\n    bs = ''\n    while n > 0:\n        r = n / 2\n        n = n // 2\n        bs = str('1' if r % 1 > 0 else '0') + bs\n\n    return bs\n```\n\nAnd this is also pretty simple. It's worth noting that the str() function call is required before concatenating the binary string variable (i.e., bs) because without it python will actually fail to execute the if-else logic and you will not get the behavior you are looking for.\n\n# Decimal Representation from Binary in Python\n\nOkay, so how do we confirm this is behaving correctly? Obviously we can just recover it.\n\n\n```python\ndef binaryToDecimal(bs: str) -> int:\n    n, r = len(bs), 0\n    for i in range(n):\n        r+= int(bs[i]) * 2**(n - i - 1)\n    return r\n```\n\nAnd that's it! If you stare at this formula for a second you'll see it's just taking each bit in the string and multiplying the $i^{th}$ binary value by $2^{n-i-1}$.\n\nWe can verify that all of this works with some simple checks and comparisons: \n\n```python\ndecimalToBinary(86) == decimalToBinary2(86) # 1010110 == 1010110 --> true\nbinaryToDecimal(decimalToBinary2(86)) == 86 # true, converted 1010110 -> 86\n```\n\nHow cool is that?  I'll note that this is only accurate for positive integers but for the general case you can use the first digit to represent the sign of the numbers (with some handling for the 0 edge case).\n\nHope you found this interesting. As I said I'll elaborate more on this post eventually but I thought I mostly wanted to share the code as I didn't really see good examples providing this back and forth and it was something that helped me understand things more concretely.\n\nHappy typing!\n\n-Francisco\n"}},"__N_SSG":true}